Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId,System.String)
Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Remarks:
Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations).
The first of given elements is set as primary one.
This constructor skips informing the addin about type change. SteelElement creation is done before the constructor call
document:
The Revit document.
idsToConnect:
List of element ids of connected elements.
typeId:
The type of Structural Connection Handler.
extEntId:
The id of the asociated ext entity
Returns:
The newly created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It verifies that we have at least one element id in the list.
-or-
The type typeId is not a valid StructuralConnectionHandlerType.
-or-
Missing detailed structural connection service implementation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetInputPoint(System.Guid)
Returns point with specified id. Returns null if specified point does not exist
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetInputPoints
Returns a list of additional points defining certain connections.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.RemoveReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Removes references from the connection.
All references in an array should belong to the connection.
picks:
The array containing picks to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more picks was not permitted to be removed from the connection.
Picks should be members of the connection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.RemoveElementIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Removes element ids from the connection.
All element ids in an array should belong to the connection.
elemIds:
The ElementIdArr containing ids of elements to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be removed from the connection.
Elements should be members of the connection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.AddReferences(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Adds references to the connection.
All references should be of applicable category.
document:
The document.
picks:
The array containing picks of input elements to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more picks was not permitted to be add to the connection.
-or-
One or more picks was not permitted to be added to the connection.
Picks should not be duplicated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.AddElementIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Adds element ids to the connection.
All element ids in an array should be of applicable category.
elemIds:
The ElementIdArr containing ids of elements to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be add to the connection.
Elements should be of applicable category.
-or-
One or more element ids was not permitted to be added to the connection.
Elements should not be duplicated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.CreateGenericConnection(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Creates a new instance of a Structural Connection Handler with a generic type, which defines the connection between given elements.
Remarks:
Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations).
The first of given elements is set as the primary one.
A generic connection type will be created by default, if there is none present in the model.
document:
The Revit document.
idsToConnect:
The list of element ids of connected elements.
Returns:
The newly created generic connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It verifies that we have at least one element id in the list.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.ConnectionInputPoint})
Creates a new instance of a Structural Connection Handler, which is defined by the elements to connect and the additional points.
Remarks:
Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations).
The first of given elements is set as primary one.
The placement of the connection takes into account the additional definition points.
document:
The Revit document.
idsToConnect:
List of element ids of connected elements.
typeId:
The type of Structural Connection Handler.
additionalInputPoints:
The array of points that help define the connection.
Returns:
The newly created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It verifies that we have at least one element id in the list.
-or-
The type typeId is not a valid StructuralConnectionHandlerType.
-or-
Missing detailed structural connection service implementation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2021

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String)
Creates custom StructuralConnectionHandlerType and StructuralConnectionHandler.
Remarks:
Input Elements are deleted. All the input elements should be of the following structural categories:
FamilyInstance (structural beams and columns).StructuralConnectionHandler elements associated to the connection.Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
OST_StructConnectionWeldsOST_StructConnectionHolesOST_StructConnectionModifiersOST_StructConnectionShearStudsOST_StructConnectionBoltsOST_StructConnectionAnchorsOST_StructConnectionPlates
document:
The Document.
elementIds:
Elements which are to be used to create custom StructuralConnectionHandlerType.
typeName:
The StructuralConnectionHandlerType name.
Returns:
The created StructuralConnectionHandler which is of just created custom StructuralConnectionHandlerType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
All the input Elements should be of the following structural categories: framings, columns, profiles, plates, bolts, anchors, shear studs, welds or structural connections.
-or-
There must be at least one StructuralConnectionHandler among the input Elements.
Total number of different input elements of input StructuralConnectionHandlers must be lower or equal to 3.
-or-
Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Remarks:
Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations).
The first of given elements is set as primary one.
document:
The Revit document.
idsToConnect:
List of element ids of connected elements.
typeId:
The type of Structural Connection Handler.
Returns:
The newly created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It verifies that we have at least one element id in the list.
-or-
The type typeId is not a valid StructuralConnectionHandlerType.
-or-
Missing detailed structural connection service implementation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.OverrideTypeParams
Allow or disallow connection's type parameters to be overridden.
Remarks:
When set to true, a set of instance parameters is created for this connection by copying the type parameter set and the user can change this instance parameters in order to make this connection different from the others of the same type.
Any further modification on type parameters will not affect this instance (until the "override" is turned back off).
When set to false the connection instance parameters are discarded and the type parameters are used again.
The default value of this parameter is false.
Since:
2020

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.ApprovalTypeId
Retrieves or changes approval type of the Structural Connection Handler.
Name of connection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017